2.3.1
Found 5216 images belonging to 2 classes.
Found 624 images belonging to 2 classes.
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 254, 254, 16)      448       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 127, 127, 16)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 125, 125, 32)      4640      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 62, 62, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 60, 60, 64)        18496     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 30, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 57600)             0         
_________________________________________________________________
dense (Dense)                (None, 512)               29491712  
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 1026      
=================================================================
Total params: 29,516,322
Trainable params: 29,516,322
Non-trainable params: 0
28s 4s/step - loss: 0.0343 - acc: 0.9858 - val_loss: 1.2775 - val_acc: 0.7788
 loss: 0.0150 - acc: 0.9939
53/53 [==============================] - 229s 4s/step - loss: 0.0150 - acc: 0.9939 - val_loss: 1.9602 - val_acc: 0.7580
