Original Sizes: (5216, 256, 256, 3) (16, 256, 256, 3) (5216, 2) (16, 2)
Flattened: (5216, 196608) (16, 196608)
(256, 256, 3)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 100)               19660900  
_________________________________________________________________
dense_1 (Dense)              (None, 128)               12928     
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 2)                 258       
=================================================================
Total params: 19,723,622
Trainable params: 19,723,622
Non-trainable params: 0
_________________________________________________________________
s 327ms/step - loss: 0.1302 - accuracy: 0.9496 - val_loss: 0.1192 - val_accuracy: 0.9375
Test loss: 0.11922448873519897
Test accuracy: 0.9375